soap_test/availability.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="http://commonsws.soa.travelio.xpt.es/">
   <soapenv:Header/>
   <soapenv:Body>
      <com:getAvailabilityV2>
         <authenticationData>
            <password>pruebas_mex</password>
            <user>pruebas_mex</user>
            <locale>es_ES</locale>
            <domain>intermundial-soaMexico</domain>
         </authenticationData>
         <availabilitySearchParams>
            <adultNumber>1</adultNumber>
            <arrivalDate>2020-05-01</arrivalDate>
            <childNumber>0</childNumber>
            <confirmedAvailability>true</confirmedAvailability>
            <departureDate>2020-05-01</departureDate>
            <productId>d4d366db-eb0f-4456</productId>
            <type>SERVICE</type>
            <varietyNumber>1</varietyNumber>
         </availabilitySearchParams>
         <excludedInfo>PRODUCT_DESCRIPTION</excludedInfo>
      </com:getAvailabilityV2>
   </soapenv:Body>
</soapenv:Envelope>
